FP/fp_summary.org
#+TITLE: FP Summary
#+AUTHOR: Olivier Lischer
#+SETUPFILE: ../latex_includes.conf
#+LATEX_CLASS_OPTIONS: [11pt,twoside,landscape]
#+LATEX_HEADER: \usepackage{caption}


\pagestyle{fancy}
\fancyhf{}
\fancyhead[R]{FP-FS22}
\fancyhead[L]{Exam Summary}
\fancyfoot[CE,CO]{\leftmark}
\fancyfoot[R]{\thepage}
\fancyfoot[L]{Olivier Lischer}
\begin{multicols}{3}


* Chapter 1 - Introduction
#+begin_quote
[...] functional programming can be viewed as a style of programming
in which the basic method of computation is the application
of functions to arguments.
  -- Graham Hutton in Programming in Haskell
#+end_quote

* Chapter 2 - First Steps
** Lazy Evaluation
Lazy Evaluation is an evaluation strategy which delays the execution of an expression until its value is needed.
The programming language [[id:c9a2a575-2295-45af-981c-4ea1c0d27363][Haskell]] is one language which use this strategy.

** Haskell Standard Prelude
The standard prelude is the standard module in [[id:c9a2a575-2295-45af-981c-4ea1c0d27363][Haskell]] which is always included unless you have the extension =NoImplicitPrelude= enabled.
In this module are the most common functions, types and monads.
This module is required to be able to implement any Haskell application.

** Haskell Naming Requirements
Every [[id:c9a2a575-2295-45af-981c-4ea1c0d27363][Haskell]] function has to start with a lower case.
After that zero or more letters (upper and lowercase), digits, underscore and forward single quotes.
Additionally, the keywords ([[id:aa4a60fb-27d2-4f64-bdd5-16713c78d334][Haskell Keywords]]) can not be used for function names or their arguments.

** Haskell Naming Convetions
List arguments have in [[id:c9a2a575-2295-45af-981c-4ea1c0d27363][Haskell]] normally the suffix =s=.
Therefor, a list of numbers might be names =ns=.
A list of arbitrary elements =xs= and a list of chars =css=.

* Chapter 3 - Types and classes
** Currying
Currying is the process of turning a multidimensional function into a function which takes one argument and returns a function which takes again one argument.
In [[id:c9a2a575-2295-45af-981c-4ea1c0d27363][Haskell]] and many other Functional Programming languages ([[id:e8b02d4a-bed3-4ec3-9938-b3d66c4e5dcb][What is functional programming?]]) this is a common practice.

#+begin_src haskell
  add :: Int -> Int -> Int
  add x y = x + y


  a = add 3 -- type Int -> Int
  b = a 4   -- type Int (7)
#+end_src

** Type Variables
Type Variables are something like a placeholder for a real type.
See the type of the =length= function:

#+begin_src haskell
  length :: [a] -> Int
  --         ^
  --         |
  -- type variable
#+end_src

The function =length= can be applied to any list of any type.
This is indicated with the type variable =a=.
A type variable must start with a lower-case letter.
Typically names are =a=, =b= and so on.
** Polymorphic types
In [[id:c9a2a575-2295-45af-981c-4ea1c0d27363][Haskell]] a type (functions are also types) is called polymorphic when it contains one or more type variables ([[id:7a94db47-052d-4233-8e8a-5a9f822bdc67][What are type variables in Haskell?]]).
** Classes
Classes in Haskell are not quite the same as in OO languages.
A class is a collection of types that support a certain overloaded operation called /method/.
Therefore, classes are more similar to Interfaces ([[id:cfdc4bb6-b46a-44e7-a721-c92e24f2be7e][Interfaces in C#]]).

** Class Constraints
Using type variables ([[id:7a94db47-052d-4233-8e8a-5a9f822bdc67][What are type variables in Haskell?]]) you can create polymorphic types ([[id:2eebdf66-7238-41e5-a319-3182050a1b4d][Polymorphic types in Haskell]]).
These type can than applied to any other types.
However, sometimes you want some restriction for example the =+= operation should only take numbers.
This can be achieved using class constraints.

#+begin_src haskell
  (+) :: Num a => a -> a -> a
  --        ^
  --        |
  -- class constraint
#+end_src

Now the type variable =a= must be an instance of the class ([[id:c1c0e325-f5f8-44d2-877e-296ccbca43c9][Classes in Haskell]]) =Num=.



** Type Overloads
A type is called overloaded when it constrains one or more class constraints ([[id:ffd3101c-0cfb-4975-acf1-22815fe45dff][What are class constraints in Haskell?]]).

* Chapter 4 - Defining Functions
** Guarded Equations
In [[id:c9a2a575-2295-45af-981c-4ea1c0d27363][Haskell]] you have multiple ways to choose between a number of possible results.
The function =abs= returns the absolute value of a number =n=.
You could write the =abs= function with guarded equations.

#+begin_src haskell
  abs n | n >= 0 = n
	| otherwise = -n

  -- in std prelude
  -- otherwise = True
#+end_src

Haskell reads from top to bottom.
The first equation which evaluates to true is taken.
=otherwise= is nothing else as =True=.
The =|= symbol is read as /such as/.


** Pattern Matching
Pattern Matching is very useful tool in [[id:c9a2a575-2295-45af-981c-4ea1c0d27363][Haskell]].
It can also be used to define functions.

#+begin_src haskell
  fst :: (a,b) -> a
  fst (x, _) = x

  snd :: (a,b) -> b
  snd (_, y) = y
#+end_src

The =_= symbol matches everything.

** List and Cons
Lists are no primitives as =Int= for example.
They are constructed from the empty list =[]= using the =:= cons operator.

The following resulting always in the same list:


#+begin_src haskell
  [1,2,3]
  1 : [2,3]
  1 : 2 : [3]
  1 : 2 : 3 : []
#+end_src

This can be really useful to define functions:

#+begin_src haskell
  head :: [a] -> a
  head (x:_) = x

  tail :: [a] -> [a]
  tail (_:xs) = xs
#+end_src

In the function definition the =()= are required.
Otherwise, it would cause syntax error (it would try to call tail / head with an argument).

** Lambdas
In [[id:c9a2a575-2295-45af-981c-4ea1c0d27363][Haskell]] lambdas are defined using the =\= symbol (should represent the \lambda symbol).

#+begin_src haskell
  \x -> x + x
  (\x -> x + x) 2


  add :: Int -> Int -> Int
  add = \x -> \y -> x + y

  odds :: Int -> [Int]
  odds n = map (\x -> x*2 + 1) [0..n-1]
#+end_src

** Operators
A function which takes two arguments are called /operators/ in [[id:c9a2a575-2295-45af-981c-4ea1c0d27363][Haskell]].
Mathematical functions are often written like the following:

#+begin_src haskell
  8 `div` 2
#+end_src

But the typical way is also possible:

#+begin_src haskell
  (+) 8 2 -- the parenthese are required
  -- >>> :t (+)
  -- (+) :: Num a => a -> a -> a

  (1+) 2 -- valid
  (+2) 1 -- valid
#+end_src

