FP/fp_summary.tex
% Created 2022-06-16 Thu 19:39
% Intended LaTeX compiler: xelatex
\documentclass[11pt,twoside,landscape]{article}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{subcaption}
\usepackage[newfloat]{minted}
\usepackage{color}
\usepackage{listings}
\usepackage[top=2cm,bottom=2cm,right=2cm,left=2cm,landscape]{geometry}
\usepackage{multicol}
\usepackage{enumitem}
\usepackage{fancyhdr}
\usepackage{caption}
\usepackage{algorithm}
\usepackage{algpseudocode}
\setlist{noitemsep}
\setlength{\parindent}{0pt}
\setlength{\columnseprule}{0.2pt}
\definecolor{mygreen}{rgb}{0,0.6,0}
\definecolor{mygray}{rgb}{0.5,0.5,0.5}
\definecolor{mymauve}{rgb}{0.58,0,0.82}
\lstset{ backgroundcolor=\color{white}, basicstyle=\footnotesize, breaklines=true, captionpos=b, commentstyle=\color{mygreen}, escapeinside={\%*}{*)},keywordstyle=\color{blue}, stringstyle=\color{mymauve},}
\usepackage{caption}
\author{Olivier Lischer}
\date{\today}
\title{FP Summary}
\hypersetup{
 pdfauthor={Olivier Lischer},
 pdftitle={FP Summary},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.1 (Org mode 9.5.4)}, 
 pdflang={English}}
\begin{document}

\pagestyle{fancy}
\fancyhf{}
\fancyhead[R]{FP-FS22}
\fancyhead[L]{Exam Summary}
\fancyfoot[CE,CO]{\leftmark}
\fancyfoot[R]{\thepage}
\fancyfoot[L]{Olivier Lischer}
\begin{multicols}{3}


\section{Chapter 1 - Introduction}
\label{sec:orgdcbf428}
\begin{quote}
[\ldots{}] functional programming can be viewed as a style of programming
in which the basic method of computation is the application
of functions to arguments.
  -- Graham Hutton in Programming in Haskell
\end{quote}

\section{Chapter 2 - First Steps}
\label{sec:org1f44ac6}
\subparagraph{Lazy Evaluation} \
\label{sec:org3655179}
Lazy Evaluation is an evaluation strategy which delays the execution of an expression until its value is needed.
The programming language \href{../../../roam/20210618182407-haskell.org}{Haskell} is one language which use this strategy.

\subparagraph{Haskell Standard Prelude} \
\label{sec:orgf8d7681}
The standard prelude is the standard module in \href{../../../roam/20210618182407-haskell.org}{Haskell} which is always included unless you have the extension \texttt{NoImplicitPrelude} enabled.
In this module are the most common functions, types and monads.
This module is required to be able to implement any Haskell application.

\subparagraph{Haskell Naming Requirements} \
\label{sec:org97f3be5}
Every \href{../../../roam/20210618182407-haskell.org}{Haskell} function has to start with a lower case.
After that zero or more letters (upper and lowercase), digits, underscore and forward single quotes.
Additionally, the keywords (\href{../../../roam/20220207164910-haskell_keywords.org}{Haskell Keywords}) can not be used for function names or their arguments.

\subparagraph{Haskell Naming Convetions} \
\label{sec:orged6f2e9}
List arguments have in \href{../../../roam/20210618182407-haskell.org}{Haskell} normally the suffix \texttt{s}.
Therefor, a list of numbers might be names \texttt{ns}.
A list of arbitrary elements \texttt{xs} and a list of chars \texttt{css}.

\section{Chapter 3 - Types and classes}
\label{sec:orgdd8c41b}
\subparagraph{Currying} \
\label{sec:orgbf10cb7}
Currying is the process of turning a multidimensional function into a function which takes one argument and returns a function which takes again one argument.
In \href{../../../roam/20210618182407-haskell.org}{Haskell} and many other Functional Programming languages (\href{../../../roam/20220126170637-what_is_functional_programming.org}{What is functional programming?}) this is a common practice.

\lstset{language=haskell,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
add :: Int -> Int -> Int
add x y = x + y


a = add 3 -- type Int -> Int
b = a 4   -- type Int (7)
\end{lstlisting}

\subparagraph{Type Variables} \
\label{sec:orga53b2e0}
Type Variables are something like a placeholder for a real type.
See the type of the \texttt{length} function:

\lstset{language=haskell,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
length :: [a] -> Int
--         ^
--         |
-- type variable
\end{lstlisting}

The function \texttt{length} can be applied to any list of any type.
This is indicated with the type variable \texttt{a}.
A type variable must start with a lower-case letter.
Typically names are \texttt{a}, \texttt{b} and so on.
\subparagraph{Polymorphic types} \
\label{sec:orgda739f5}
In \href{../../../roam/20210618182407-haskell.org}{Haskell} a type (functions are also types) is called polymorphic when it contains one or more type variables (\href{../../../roam/20220217094938-what_are_type_variables_in_haskell.org}{What are type variables in Haskell?}).
\subparagraph{Classes} \
\label{sec:org55ac3c5}
Classes in Haskell are not quite the same as in OO languages.
A class is a collection of types that support a certain overloaded operation called \emph{method}.
Therefore, classes are more similar to Interfaces (\href{../../../roam/20211029131058-interfaces_in_c.org}{Interfaces in C\#}).

\subparagraph{Class Constraints} \
\label{sec:org588c210}
Using type variables (\href{../../../roam/20220217094938-what_are_type_variables_in_haskell.org}{What are type variables in Haskell?}) you can create polymorphic types (\href{../../../roam/20220217095201-polymorphic_types_in_haskell.org}{Polymorphic types in Haskell}).
These type can than applied to any other types.
However, sometimes you want some restriction for example the \texttt{+} operation should only take numbers.
This can be achieved using class constraints.

\lstset{language=haskell,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
(+) :: Num a => a -> a -> a
--        ^
--        |
-- class constraint
\end{lstlisting}

Now the type variable \texttt{a} must be an instance of the class (\href{../../../roam/20220217095852-classes_in_haskell.org}{Classes in Haskell}) \texttt{Num}.



\subparagraph{Type Overloads} \
\label{sec:org8a4bf32}
A type is called overloaded when it constrains one or more class constraints (\href{../../../roam/20220217095938-what_are_class_constraints_in_haskell.org}{What are class constraints in Haskell?}).

\section{Chapter 4 - Defining Functions}
\label{sec:org0694c70}
\subparagraph{Guarded Equations} \
\label{sec:orgca8cc8c}
In \href{../../../roam/20210618182407-haskell.org}{Haskell} you have multiple ways to choose between a number of possible results.
The function \texttt{abs} returns the absolute value of a number \texttt{n}.
You could write the \texttt{abs} function with guarded equations.

\lstset{language=haskell,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
abs n | n >= 0 = n
      | otherwise = -n

-- in std prelude
-- otherwise = True
\end{lstlisting}

Haskell reads from top to bottom.
The first equation which evaluates to true is taken.
\texttt{otherwise} is nothing else as \texttt{True}.
The \texttt{|} symbol is read as \emph{such as}.


\subparagraph{Pattern Matching} \
\label{sec:org81b2e9b}
Pattern Matching is very useful tool in \href{../../../roam/20210618182407-haskell.org}{Haskell}.
It can also be used to define functions.

\lstset{language=haskell,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
fst :: (a,b) -> a
fst (x, _) = x

snd :: (a,b) -> b
snd (_, y) = y
\end{lstlisting}

The \texttt{\_} symbol matches everything.

\subparagraph{List and Cons} \
\label{sec:org9bce8c6}
Lists are no primitives as \texttt{Int} for example.
They are constructed from the empty list \texttt{[]} using the \texttt{:} cons operator.

The following resulting always in the same list:


\lstset{language=haskell,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
[1,2,3]
1 : [2,3]
1 : 2 : [3]
1 : 2 : 3 : []
\end{lstlisting}

This can be really useful to define functions:

\lstset{language=haskell,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
head :: [a] -> a
head (x:_) = x

tail :: [a] -> [a]
tail (_:xs) = xs
\end{lstlisting}

In the function definition the \texttt{()} are required.
Otherwise, it would cause syntax error (it would try to call tail / head with an argument).

\subparagraph{Lambdas} \
\label{sec:org278f72f}
In \href{../../../roam/20210618182407-haskell.org}{Haskell} lambdas are defined using the \texttt{\textbackslash{}} symbol (should represent the \(\lambda\) symbol).

\lstset{language=haskell,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
\x -> x + x
(\x -> x + x) 2


add :: Int -> Int -> Int
add = \x -> \y -> x + y

odds :: Int -> [Int]
odds n = map (\x -> x*2 + 1) [0..n-1]
\end{lstlisting}

\subparagraph{Operators} \
\label{sec:org9384d9c}
A function which takes two arguments are called \emph{operators} in \href{../../../roam/20210618182407-haskell.org}{Haskell}.
Mathematical functions are often written like the following:

\lstset{language=haskell,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
8 `div` 2
\end{lstlisting}

But the typical way is also possible:

\lstset{language=haskell,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
(+) 8 2 -- the parenthese are required
-- >>> :t (+)
-- (+) :: Num a => a -> a -> a

(1+) 2 -- valid
(+2) 1 -- valid
\end{lstlisting}
