FP/fp_summary.org
** Operator Sections
Operator Sections are the partial evaluated parts of an operator ([[id:dabba7f6-3c96-4bc4-b5db-2b3de4a6ec19][What are operators in Haskell?]]).
The following are examples are operator sections:

#+begin_src haskell
  (+)
  (1+)
  (+2)

  (op) = \x -> (\y -> x op y)
  (x op) = \y -> x op y
  (op y) = \x -> x op y
#+end_src

Operator Sections are required because an operator alone is not a valid expression in [[id:c9a2a575-2295-45af-981c-4ea1c0d27363][Haskell]].
Therefore, for functions like =foldl= operation sections are required:

#+begin_src haskell
  sum :: [Int] -> Int
  sum xs = foldl (+) 0 xs
#+end_src

* Chapter 5 - List comprehensions
** List comprehension
In [[id:797e56f5-504a-47c2-9817-a7368c910f48][Math]] you can create from one set of numbers a new set of numbers:
\begin{equation}
\{ x^2 | x \in \{1 \ldots 5 \} \}
\end{equation}

In Haskell you can do the same:

#+begin_src haskell
  [x^2 | x <- [1..5]]
  --   ^    ^     ^ 
  --   |    |---  |-------- Generator
  -- "such as" |
  --          "is drawn from"
#+end_src

The list comprehension requireds at least one generator but multiple generators are allowed.

#+begin_src haskell
  [(x, y) | x <- [1,2,3], y <- [4,5]]
  [(x, y) | x <- [1..3], y <- [x..3]]
#+end_src

** Usage of list comprehensions
When you are creating new lists using list comprehension ([[id:d74c91ca-a1ea-4e98-80fe-279fa1683ced][What is list comprehension in Haskell?]]) you dont always want to take all values.
When creating a list using list comprehension ([[id:d74c91ca-a1ea-4e98-80fe-279fa1683ced][What is list comprehension in Haskell?]]) you have sometimes certain criterias which must be true.
For example you want a list with only even numbers.
This can be achived using a /guard/.
Evaluates the guard to =True= the value is taken.
Otherwise, the value is discareded.

#+begin_src haskell
  [x | x <- [1..10], even x] -- generates a list of even numbers
  --                   ^
  --                   |
  --                 Guard
#+end_src

* Chapter 6 - Recursive Functions
** Recursion
It exists different kind of recursion:
- linear & tail recursion ([[id:34b61806-bd26-4d9e-ab15-2059a3ba4663][What is linear recursion?]])
- multiple recursion ([[id:454696af-4430-421b-95bf-ce3b8eb0c377][What is multiple recursion?]])
- mutual recursion ([[id:9c7c33dc-c978-4578-8eb1-2e4fae5d88a6][What is mutual recursion?]])


** Recursive Functions
1. Define type
2. Enumerate the cases
3. Define the simple case
   - Often the base case
4. Define the other cases
   - Often the recursive cases
5. Generalize and simplify


#+begin_src haskell
  -- Step 1
  product :: [Int] -> Int

  -- Step 2
  product :: [Int] -> Int
  product :: [] =
  product :: (n:ns) =

  -- Step 3
  product :: [Int] -> Int
  product :: [] = 1
  product :: (n:ns) = 

  -- Step 4
  product :: [Int] -> Int
  product :: [] = 1
  product :: (n:ns) = n * product ns


  -- Step 5
  product :: Num a => [a] -> a
  product = foldr (*) 1
#+end_src

* Chapter 7 - Higher-order Functions
** Higher-Order Functions
A higher-order function is a function which takes another function as an argument and / or returns a function.
However, returning a function is often only called a curried function ([[id:32a85cf4-8bb6-4c67-9ff2-8d8594dcb6f5][What is curring in terms of math?]]) and
higher-order means often only taking a function as argument.


#+begin_src haskell
  isEven :: [Int] -> [Bool]
  isEven xs = map even xs

  isEven [1,2,3,4,5,6,7]
  [False,True,False,True,False,True,False]
#+end_src

** foldr and foldl
/foldr/ and /foldl/ are the abbreviation for fold right / left.
Many functions can be defined using the following pattern:

#+begin_src haskell
  f [] = v -- some value
  f (x:xs) = x # f xs -- for example x + f xs
#+end_src

The function /foldr/ can be used to encapsulate this pattern.
You can think that /foldr/ replaces the =:= with the operation =#=.
#+begin_src haskell
  sum :: Num a => [a] -> a
  sum [] = 0
  sum (x:xs) = x + sum xs


  sum_foldr :: Num a => [a] -> a
  sum_foldr = foldr (+) 0

  {-
  sum_foldr [1,2,3] =
  sum_foldr 1 : (2 : (3 : [])) = 
  1 + (2 + (3 + 0)) = 
  6
  -}

  sum_foldl :: Num a => [a] -> a
  sum_foldl = foldl (+) 0
  {-
  sum_foldl [1,2,3] =
  sum_foldl 1 : (2 : (3 : [])) = 
  ((0 + 1) + 2) + 3 =
  6
  -}
#+end_src




** Composition Operator
The composition operator takes two function as argument and returns the composition of both.
Therefore, is =(f . g) x = f (g x)= true.
This is very useful to simplify nested function calls.


#+begin_src haskell
  odd :: Int -> Bool
  odd n = not (even n)
  odd n = not . even n

  twice :: (a -> a) -> a -> a
  twice f x = f (f x)

  sumsqreven :: [Int] -> [Int]
  sumsqreven xs = sum (map (^2) (filter even xs))
  sumsqreven = sum . map (^2) . filter even

  sumsqreven [1,2,3,4,5] -- 20
#+end_src

* Chapter 8 - Declaring types / classes
** Create new types
In Haskell, you have multiple ways to create an new type.
- =type= ([[id:49e5de1c-52f4-4013-8216-464381809a86][The type keyword in Haskell]])
- =data= ([[id:c2a9bc31-3b7a-4652-a78b-3ec84d995a09][The data keyword in Haskell]])
- =newtype= ([[id:590d4a81-04c3-47bf-9b64-2e97540d510d][The newtype keyword in Haskell]])

** type
Using the keyword =type= you create basically an alias for the type.

#+begin_src haskell
  type String = [Char]
#+end_src

Recursive definition for a new type using =type= is *not* allowed:
#+begin_src haskell
type Tree = (Int, [Tree]) -- Not allowed
#+end_src

Typed declared using the =type= mechanism can not be made into new instances of classes ([[id:c1c0e325-f5f8-44d2-877e-296ccbca43c9][Classes in Haskell]]).
  

** data

Using the keyword =data= you create real new types.

#+begin_src haskell
  data Bool = False | True
  data Move = North | South | East | West
#+end_src


The new values (North, South, ...) must be unique and are called *constructors*.

#+begin_src haskell
  data Shape = Circle Float | Rect Float Float


  area :: Shape -> Float
  area (Circle r) = pi * r^2
  area (Rect x y) = x * y


  {-
  :t Circle
  Circle :: Float -> Shape
  :t Rect
  Rect :: Float -> Float -> Shape
  -}
#+end_src

The =Circle= and =Rect= from the example are called *constructor functions*.

** newtype
Different to the =type= keyword ([[id:49e5de1c-52f4-4013-8216-464381809a86][The type keyword in Haskell]]) with =newtype= you create a real new type.

#+begin_src haskell
  newtype Nat = N Int

  someFunc :: Nat -> Nat
  someFunc x = x
#+end_src

For the function =someFunc= you can *not* use an =Int= (type safety).
However, at compile time the =Nat= is replaced with =Int=.
Therefore, I have type safety during development without performance impact (=data Nat = N Int= would be slower).

** class
#+begin_src haskell
  class Eq a where
    (==), (/=) :: a -> a -> Bool
    x /= y = not (x == y)
#+end_src



