FP/fp_summary.tex

\subparagraph{Operator Sections} \
\label{sec:org388025c}
Operator Sections are the partial evaluated parts of an operator (\href{../../../roam/20220221074036-what_are_operators_in_haskell.org}{What are operators in Haskell?}).
The following are examples are operator sections:

\lstset{language=haskell,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
(+)
(1+)
(+2)

(op) = \x -> (\y -> x op y)
(x op) = \y -> x op y
(op y) = \x -> x op y
\end{lstlisting}

Operator Sections are required because an operator alone is not a valid expression in \href{../../../roam/20210618182407-haskell.org}{Haskell}.
Therefore, for functions like \texttt{foldl} operation sections are required:

\lstset{language=haskell,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
sum :: [Int] -> Int
sum xs = foldl (+) 0 xs
\end{lstlisting}

\section{Chapter 5 - List comprehensions}
\label{sec:orgdc9ddde}
\subparagraph{List comprehension} \
\label{sec:org35beee9}
In \href{../../../roam/20200914131723-math.org}{Math} you can create from one set of numbers a new set of numbers:
\begin{equation}
\{ x^2 | x \in \{1 \ldots 5 \} \}
\end{equation}

In Haskell you can do the same:

\lstset{language=haskell,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
[x^2 | x <- [1..5]]
--   ^    ^     ^ 
--   |    |---  |-------- Generator
-- "such as" |
--          "is drawn from"
\end{lstlisting}

The list comprehension requireds at least one generator but multiple generators are allowed.

\lstset{language=haskell,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
[(x, y) | x <- [1,2,3], y <- [4,5]]
[(x, y) | x <- [1..3], y <- [x..3]]
\end{lstlisting}

\subparagraph{Usage of list comprehensions} \
\label{sec:org793d3cd}
When you are creating new lists using list comprehension (\href{../../../roam/20220221080228-what_is_list_comprehension_in_haskell.org}{What is list comprehension in Haskell?}) you dont always want to take all values.
When creating a list using list comprehension (\href{../../../roam/20220221080228-what_is_list_comprehension_in_haskell.org}{What is list comprehension in Haskell?}) you have sometimes certain criterias which must be true.
For example you want a list with only even numbers.
This can be achived using a \emph{guard}.
Evaluates the guard to \texttt{True} the value is taken.
Otherwise, the value is discareded.

\lstset{language=haskell,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
[x | x <- [1..10], even x] -- generates a list of even numbers
--                   ^
--                   |
--                 Guard
\end{lstlisting}

\section{Chapter 6 - Recursive Functions}
\label{sec:org7b49ee3}
\subparagraph{Recursion} \
\label{sec:org2e87530}
It exists different kind of recursion:
\begin{itemize}
\item linear \& tail recursion (\href{../../../roam/20220307065956-what_is_linear_recursion.org}{What is linear recursion?})
\item multiple recursion (\href{../../../roam/20220307071006-what_is_multiple_recursion.org}{What is multiple recursion?})
\item mutual recursion (\href{../../../roam/20220307071331-what_is_mutual_recursion.org}{What is mutual recursion?})
\end{itemize}


\subparagraph{Recursive Functions} \
\label{sec:org4bee947}
\begin{enumerate}
\item Define type
\item Enumerate the cases
\item Define the simple case
\begin{itemize}
\item Often the base case
\end{itemize}
\item Define the other cases
\begin{itemize}
\item Often the recursive cases
\end{itemize}
\item Generalize and simplify
\end{enumerate}


\lstset{language=haskell,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
-- Step 1
product :: [Int] -> Int

-- Step 2
product :: [Int] -> Int
product :: [] =
product :: (n:ns) =

-- Step 3
product :: [Int] -> Int
product :: [] = 1
product :: (n:ns) = 

-- Step 4
product :: [Int] -> Int
product :: [] = 1
product :: (n:ns) = n * product ns


-- Step 5
product :: Num a => [a] -> a
product = foldr (*) 1
\end{lstlisting}

\section{Chapter 7 - Higher-order Functions}
\label{sec:org1cd6e6b}
\subparagraph{Higher-Order Functions} \
\label{sec:org18fbc54}
A higher-order function is a function which takes another function as an argument and / or returns a function.
However, returning a function is often only called a curried function (\href{../../../roam/20220217093010-what_is_curring_in_terms_of_math.org}{What is curring in terms of math?}) and
higher-order means often only taking a function as argument.


\lstset{language=haskell,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
isEven :: [Int] -> [Bool]
isEven xs = map even xs

isEven [1,2,3,4,5,6,7]
[False,True,False,True,False,True,False]
\end{lstlisting}

\subparagraph{foldr and foldl} \
\label{sec:org73137a5}
\emph{foldr} and \emph{foldl} are the abbreviation for fold right / left.
Many functions can be defined using the following pattern:

\lstset{language=haskell,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
f [] = v -- some value
f (x:xs) = x # f xs -- for example x + f xs
\end{lstlisting}

The function \emph{foldr} can be used to encapsulate this pattern.
You can think that \emph{foldr} replaces the \texttt{:} with the operation \texttt{\#}.
\lstset{language=haskell,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
sum :: Num a => [a] -> a
sum [] = 0
sum (x:xs) = x + sum xs


sum_foldr :: Num a => [a] -> a
sum_foldr = foldr (+) 0

{-
sum_foldr [1,2,3] =
sum_foldr 1 : (2 : (3 : [])) = 
1 + (2 + (3 + 0)) = 
6
-}

sum_foldl :: Num a => [a] -> a
sum_foldl = foldl (+) 0
{-
sum_foldl [1,2,3] =
sum_foldl 1 : (2 : (3 : [])) = 
((0 + 1) + 2) + 3 =
6
-}
\end{lstlisting}




\subparagraph{Composition Operator} \
\label{sec:orgc94e9cc}
The composition operator takes two function as argument and returns the composition of both.
Therefore, is \texttt{(f . g) x = f (g x)} true.
This is very useful to simplify nested function calls.


\lstset{language=haskell,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
odd :: Int -> Bool
odd n = not (even n)
odd n = not . even n

twice :: (a -> a) -> a -> a
twice f x = f (f x)

sumsqreven :: [Int] -> [Int]
sumsqreven xs = sum (map (^2) (filter even xs))
sumsqreven = sum . map (^2) . filter even

sumsqreven [1,2,3,4,5] -- 20
\end{lstlisting}

\section{Chapter 8 - Declaring types / classes}
\label{sec:orgc4a8f81}
\subparagraph{Create new types} \
\label{sec:org0d323d8}
In Haskell, you have multiple ways to create an new type.
\begin{itemize}
\item \texttt{type} (\href{../../../roam/20220321113101-the_type_keyword_in_haskell.org}{The type keyword in Haskell})
\item \texttt{data} (\href{../../../roam/20220321113711-the_data_keyword_in_haskell.org}{The data keyword in Haskell})
\item \texttt{newtype} (\href{../../../roam/20220321114408-the_newtype_keyword_in_haskell.org}{The newtype keyword in Haskell})
\end{itemize}

\subparagraph{type} \
\label{sec:org656a0bf}
Using the keyword \texttt{type} you create basically an alias for the type.

\lstset{language=haskell,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
type String = [Char]
\end{lstlisting}

Recursive definition for a new type using \texttt{type} is \textbf{not} allowed:
\lstset{language=haskell,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
type Tree = (Int, [Tree]) -- Not allowed
\end{lstlisting}

Typed declared using the \texttt{type} mechanism can not be made into new instances of classes (\href{../../../roam/20220217095852-classes_in_haskell.org}{Classes in Haskell}).


\subparagraph{data} \
\label{sec:orga9de618}

Using the keyword \texttt{data} you create real new types.

\lstset{language=haskell,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
data Bool = False | True
data Move = North | South | East | West
\end{lstlisting}


The new values (North, South, \ldots{}) must be unique and are called \textbf{constructors}.

\lstset{language=haskell,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
data Shape = Circle Float | Rect Float Float


area :: Shape -> Float
area (Circle r) = pi * r^2
area (Rect x y) = x * y


{-
:t Circle
Circle :: Float -> Shape
:t Rect
Rect :: Float -> Float -> Shape
-}
\end{lstlisting}

The \texttt{Circle} and \texttt{Rect} from the example are called \textbf{constructor functions}.

\subparagraph{newtype} \
\label{sec:org24387c4}
Different to the \texttt{type} keyword (\href{../../../roam/20220321113101-the_type_keyword_in_haskell.org}{The type keyword in Haskell}) with \texttt{newtype} you create a real new type.

\lstset{language=haskell,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
newtype Nat = N Int

someFunc :: Nat -> Nat
someFunc x = x
\end{lstlisting}

For the function \texttt{someFunc} you can \textbf{not} use an \texttt{Int} (type safety).
However, at compile time the \texttt{Nat} is replaced with \texttt{Int}.
Therefore, I have type safety during development without performance impact (\texttt{data Nat = N Int} would be slower).
