FP/fp_summary.org
** implement class
#+begin_src haskell
  instance Eq Bool where
    False == False = True
    True == True = True
    _ == _ = False

  data T a = Leaf | Node (T a) a (T a)

  instance Show a => Show (T a) where
    show x = show (toList x)

  instance Eq a => Eq (T a) where
    (==) x y = toList x == toList y

  instance Ord a => Semigroup (T a) where
    x <> y = merge x y

  instance Ord a => Monoid (T a) where
    mempty = empty
#+end_src

* Chapter 10 - Interactive Programming
** Interactive Programming
[[id:c9a2a575-2295-45af-981c-4ea1c0d27363][Haskell]] is a pure functional programming language.
Therefore, side effects are not allowed and because of this interactive programming should not be possible.
Haskell overcomes this problem using IO actions ([[id:706857b7-3a3a-4996-b6af-6c732907110b][IO actions in haskell]]).

** IO Action
=IO= can be seen as a data type which represents the whole world and is built-in into [[id:c9a2a575-2295-45af-981c-4ea1c0d27363][Haskell]].
The most important actions for interactive programming are:
- =getChar=
- =putChar=
- =return=

#+begin_src haskell
  getChar :: IO Char
  putChar :: Char -> IO ()
  return :: a -> IO a
#+end_src

=return= is a very important action which produces from a normal value an action with this value.

#+begin_src haskell
  myFunc :: IO a
  myFunc = do v1 <- a1
	      v2 <- a2
	      v3 <- a3
	      vn <- an
	      return (f v1 v2 v3 vn)
#+end_src

* Chapter 12 - Monads and more
** Functor
A functor is a class ([[id:c1c0e325-f5f8-44d2-877e-296ccbca43c9][Classes in Haskell]]) which provides the =fmap= function.
To be a valid functor the restrictions from listening ref:lst:functor-laws.

#+begin_quote
Functors are types that wrap values of other types
and allow us to map functions over the wrapped value. -- Fahrad Metha
#+end_quote

#+begin_src haskell
  class Functor f where
    fmap :: (a -> b) -> f a -> f b
#+end_src

#+CAPTION: Functor laws
#+NAME: lst:functor-laws
#+begin_src haskell
  fmap id = id
  fmap (g . h) = fmap g . fmap h
#+end_src

** Applicatvie Functors
=fmap= takes a function which takes only one argument ([[id:7d8a3ac1-acb0-4eee-9377-01570988298b][What is a functor in haskell?]]).
#+begin_src haskell
  fmap :: Functor f => (a -> b) -> f a -> f b
#+end_src

Sometimes it is required to provide a function with two or more input arguments.
For this use case the =Applicative= typeclass ([[id:c1c0e325-f5f8-44d2-877e-296ccbca43c9][Classes in Haskell]]) exists (see ref:lst:applicative-class).

#+CAPTION: Applicative Class
#+NAME: lst:applicative-class
#+begin_src haskell
  class Functor f => Applicative f where
    pure :: a -> f a
    (<*>) :: f (a -> b) -> f a -> f b


  g <*> x <*> y <*> z == ((g <*> x) <*> y) <*> z
  pure g <*> x1 <*> x2 <*> xn
#+end_src


The =pure= function returns a functor with a value, noramally a function (see ref:fig:maybe-as-an-applicative-example).
The function must be a curried ([[id:32a85cf4-8bb6-4c67-9ff2-8d8594dcb6f5][What is curring in terms of math?]]) one and takes n arguments.
The =<*>= operator is now used to perform partial application and is used n times.
The =<*>= operator uses =fmap= to apply the function to the elemens.

#+CAPTION: Maybe as an Applicative example
#+NAME: fig:maybe-as-an-applicative-example
#+begin_src haskell
  instance Applicative Maybe where
    -- pure :: a -> Maybe a
    pure = Just
    -- (<*>) :: Maybe (a -> b) -> Maybe a -> Maybe b
    --                  |          |
    --    ---------------          |
    --    |      -------------------
    --           |
    (Just g) <*> mx = fmap g mx
    Nothing <*> _ = Nothing


  myVar :: Maybe (Int -> Int)
  myVar = pure (+) 
  pure (+) <*> Just 1 <*> Just 2
  -- Just 3
#+end_src


** Monad
Monad is a typeclass in [[id:c9a2a575-2295-45af-981c-4ea1c0d27363][Haskell]] with the definition in listening ref:lst:monad-class-definition.

#+CAPTION: Monad Class definition
#+NAME: lst:monad-class-definition
#+begin_src haskell
  class Applicative m => Monad m where
    return :: a -> m a
    (>>=) :: m a -> (a -> m b) -> m b

    return = pure
#+end_src

The =>>== operator takes a container with a value (=Just 2=), unwraps the value (=2=) and feed into the function, which returns again an container.

#+begin_src haskell
  myAddOne :: Int -> Maybe Int
  myAddOne x = Just (x+1)

  myValue :: Maybe Int
  myValue = Just 2 >>= myAddOne
#+end_src

** Monad Example
The =>>== operator for =Maybe= could look like in ref:lst:the-bind-operator-for-maybe.

#+CAPTION: The bind operator for Maybe
#+NAME: lst:the-bind-operator-for-maybe
#+begin_src haskell
  -- (>>=) :: Maybe a -> (a -> Maybe b) -> Maybe b
  mx >>= f = case mx of
	       Nothing -> Nothing
	       Just x -> f x
#+end_src

In ref:fig:example-of-the-monad-typeclass the =eval= function is declared 3 times.
Every definition does the exact same thing.
The latter two variants are using the bind operator (>>=) from the Monad type class.

#+CAPTION: Example of the monad typeclass in action
#+NAME: fig:example-of-the-monad-typeclass
#+begin_src haskell
  data Expr = Val Int | Div Expr Expr

  eval :: Expr -> Maybe Int
  eval (Val n) = Just n
  eval (Div x y) = case eval x of
		     Nothing -> Nothing
		     Just n -> case eval y of
		       Nothing -> Nothing
		       Just m -> safediv n m

  eval (Div x y) = eval x >>= \n ->
		   eval y >>= \m ->
		   safediv n m 

  eval (Div x y) = do n <- eval x
		      m <- eval y
		      safediv n m


  safediv :: Int -> Int -> Maybe Int
  safediv _ 0 = Nothing
  safediv n m = Just (n `div` m)
#+end_src

** let expression
The =let= expression is just syntactical sugar for immediate lambda evaluation.
#+begin_src haskell
let name =  value in body
( \name -> body ) value
#+end_src

* Lambda Calculus
** Lambda Calculus
The lambda calculus is a programming language and the base for all functional programming languages.
In the lambda calculus you only have the "$\lambda$", ".", "(", and ")" as reserved words.
Everything else is achieved using function application.

The lambda calculus has only two concepts: Predicates (P) and $\lambda$-terms (M).

#+begin_src latex
  \begin{equation}
    \begin{align}
      \label{eqn:syntax-of-lc}
      P &::= M = M \\
      M &::= x \; | \; \lambda x . \; M \; | \; M M
    \end{align}
  \end{equation}
#+end_src

** Free / Bound Variables
In the lambda calculus you can use variables as placeholder.
It exists two types of variables: bound and free variables.
Bound variables are bound to a lambda term (y in equation eqref:eqn:bound-and-free-variables).
Bound variables are only valid inside the lambda term.
They are only placeholders and therefore can be renamed.

The free variables (a, b in eqref:eqn:bound-and-free-variables) are globaly valid.


#+begin_src latex
  \begin{equation}
    \label{eqn:bound-and-free-variables}
    (\lambda y. \; y) a \; b
  \end{equation}
#+end_src


