FP/fp_summary.tex

\subparagraph{class} \
\label{sec:orgb7e9cc6}
\lstset{language=haskell,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
class Eq a where
  (==), (/=) :: a -> a -> Bool
  x /= y = not (x == y)
\end{lstlisting}



\subparagraph{implement class} \
\label{sec:org955a08d}
\lstset{language=haskell,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
instance Eq Bool where
  False == False = True
  True == True = True
  _ == _ = False

data T a = Leaf | Node (T a) a (T a)

instance Show a => Show (T a) where
  show x = show (toList x)

instance Eq a => Eq (T a) where
  (==) x y = toList x == toList y

instance Ord a => Semigroup (T a) where
  x <> y = merge x y

instance Ord a => Monoid (T a) where
  mempty = empty
\end{lstlisting}

\section{Chapter 10 - Interactive Programming}
\label{sec:org6229c8f}
\subparagraph{Interactive Programming} \
\label{sec:org8eaabfc}
\href{../../../roam/20210618182407-haskell.org}{Haskell} is a pure functional programming language.
Therefore, side effects are not allowed and because of this interactive programming should not be possible.
Haskell overcomes this problem using IO actions (\href{../../../roam/20220508103131-io_actions_in_haskell.org}{IO actions in haskell}).

\subparagraph{IO Action} \
\label{sec:orgc696f9d}
\texttt{IO} can be seen as a data type which represents the whole world and is built-in into \href{../../../roam/20210618182407-haskell.org}{Haskell}.
The most important actions for interactive programming are:
\begin{itemize}
\item \texttt{getChar}
\item \texttt{putChar}
\item \texttt{return}
\end{itemize}

\lstset{language=haskell,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
getChar :: IO Char
putChar :: Char -> IO ()
return :: a -> IO a
\end{lstlisting}

\texttt{return} is a very important action which produces from a normal value an action with this value.

\lstset{language=haskell,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
myFunc :: IO a
myFunc = do v1 <- a1
	    v2 <- a2
	    v3 <- a3
	    vn <- an
	    return (f v1 v2 v3 vn)
\end{lstlisting}

\section{Chapter 12 - Monads and more}
\label{sec:org00c2d90}
\subparagraph{Functor} \
\label{sec:org2241332}
A functor is a class (\href{../../../roam/20220217095852-classes_in_haskell.org}{Classes in Haskell}) which provides the \texttt{fmap} function.
To be a valid functor the restrictions from listening \ref{lst:functor-laws}.

\begin{quote}
Functors are types that wrap values of other types
and allow us to map functions over the wrapped value. -- Fahrad Metha
\end{quote}

\lstset{language=haskell,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
class Functor f where
  fmap :: (a -> b) -> f a -> f b
\end{lstlisting}

\lstset{language=haskell,label=lst:functor-laws,caption={Functor laws},captionpos=b,numbers=none}
\begin{lstlisting}
fmap id = id
fmap (g . h) = fmap g . fmap h
\end{lstlisting}

\subparagraph{Applicatvie Functors} \
\label{sec:orgffcd899}
\texttt{fmap} takes a function which takes only one argument (\href{../../../roam/20220508104313-what_is_a_functor_in_haskell.org}{What is a functor in haskell?}).
\lstset{language=haskell,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
fmap :: Functor f => (a -> b) -> f a -> f b
\end{lstlisting}

Sometimes it is required to provide a function with two or more input arguments.
For this use case the \texttt{Applicative} typeclass (\href{../../../roam/20220217095852-classes_in_haskell.org}{Classes in Haskell}) exists (see \ref{lst:applicative-class}).

\lstset{language=haskell,label=lst:applicative-class,caption={Applicative Class},captionpos=b,numbers=none}
\begin{lstlisting}
class Functor f => Applicative f where
  pure :: a -> f a
  (<*>) :: f (a -> b) -> f a -> f b


g <*> x <*> y <*> z == ((g <*> x) <*> y) <*> z
pure g <*> x1 <*> x2 <*> xn
\end{lstlisting}


The \texttt{pure} function returns a functor with a value, noramally a function (see \ref{fig:maybe-as-an-applicative-example}).
The function must be a curried (\href{../../../roam/20220217093010-what_is_curring_in_terms_of_math.org}{What is curring in terms of math?}) one and takes n arguments.
The \texttt{<*>} operator is now used to perform partial application and is used n times.
The \texttt{<*>} operator uses \texttt{fmap} to apply the function to the elemens.

\lstset{language=haskell,label=fig:maybe-as-an-applicative-example,caption={Maybe as an Applicative example},captionpos=b,numbers=none}
\begin{lstlisting}
instance Applicative Maybe where
  -- pure :: a -> Maybe a
  pure = Just
  -- (<*>) :: Maybe (a -> b) -> Maybe a -> Maybe b
  --                  |          |
  --    ---------------          |
  --    |      -------------------
  --           |
  (Just g) <*> mx = fmap g mx
  Nothing <*> _ = Nothing


myVar :: Maybe (Int -> Int)
myVar = pure (+) 
pure (+) <*> Just 1 <*> Just 2
-- Just 3
\end{lstlisting}


\subparagraph{Monad} \
\label{sec:orgee11172}
Monad is a typeclass in \href{../../../roam/20210618182407-haskell.org}{Haskell} with the definition in listening \ref{lst:monad-class-definition}.

\lstset{language=haskell,label=lst:monad-class-definition,caption={Monad Class definition},captionpos=b,numbers=none}
\begin{lstlisting}
class Applicative m => Monad m where
  return :: a -> m a
  (>>=) :: m a -> (a -> m b) -> m b

  return = pure
\end{lstlisting}

The \texttt{>>=} operator takes a container with a value (\texttt{Just 2}), unwraps the value (\texttt{2}) and feed into the function, which returns again an container.

\lstset{language=haskell,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
myAddOne :: Int -> Maybe Int
myAddOne x = Just (x+1)

myValue :: Maybe Int
myValue = Just 2 >>= myAddOne
\end{lstlisting}

\subparagraph{Monad Example} \
\label{sec:orgf84c560}
The \texttt{>>=} operator for \texttt{Maybe} could look like in \ref{lst:the-bind-operator-for-maybe}.

\lstset{language=haskell,label=lst:the-bind-operator-for-maybe,caption={The bind operator for Maybe},captionpos=b,numbers=none}
\begin{lstlisting}
-- (>>=) :: Maybe a -> (a -> Maybe b) -> Maybe b
mx >>= f = case mx of
	     Nothing -> Nothing
	     Just x -> f x
\end{lstlisting}

In \ref{fig:example-of-the-monad-typeclass} the \texttt{eval} function is declared 3 times.
Every definition does the exact same thing.
The latter two variants are using the bind operator (>>=) from the Monad type class.

\lstset{language=haskell,label=fig:example-of-the-monad-typeclass,caption={Example of the monad typeclass in action},captionpos=b,numbers=none}
\begin{lstlisting}
data Expr = Val Int | Div Expr Expr

eval :: Expr -> Maybe Int
eval (Val n) = Just n
eval (Div x y) = case eval x of
		   Nothing -> Nothing
		   Just n -> case eval y of
		     Nothing -> Nothing
		     Just m -> safediv n m

eval (Div x y) = eval x >>= \n ->
		 eval y >>= \m ->
		 safediv n m 

eval (Div x y) = do n <- eval x
		    m <- eval y
		    safediv n m


safediv :: Int -> Int -> Maybe Int
safediv _ 0 = Nothing
safediv n m = Just (n `div` m)
\end{lstlisting}

\subparagraph{let expression} \
\label{sec:org5a5a97e}
The \texttt{let} expression is just syntactical sugar for immediate lambda evaluation.
\lstset{language=haskell,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
let name =  value in body
( \name -> body ) value
\end{lstlisting}

\section{Lambda Calculus}
\label{sec:orga9ba72c}
\subparagraph{Lambda Calculus} \
\label{sec:org4fc2f83}
The lambda calculus is a programming language and the base for all functional programming languages.
In the lambda calculus you only have the "\(\lambda\)", ".", "(", and ")" as reserved words.
Everything else is achieved using function application.

The lambda calculus has only two concepts: Predicates (P) and \$\(\lambda\)\$-terms (M).

\begin{equation}
  \begin{align}
    \label{eqn:syntax-of-lc}
    P &::= M = M \\
    M &::= x \; | \; \lambda x . \; M \; | \; M M
  \end{align}
\end{equation}

\subparagraph{Free / Bound Variables} \
\label{sec:org89f4dc7}
In the lambda calculus you can use variables as placeholder.
It exists two types of variables: bound and free variables.
Bound variables are bound to a lambda term (y in equation \eqref{eqn:bound-and-free-variables}).
Bound variables are only valid inside the lambda term.
They are only placeholders and therefore can be renamed.

The free variables (a, b in \eqref{eqn:bound-and-free-variables}) are globaly valid.


\begin{equation}
  \label{eqn:bound-and-free-variables}
  (\lambda y. \; y) a \; b
\end{equation}
