FP/fp_summary.org
** Alpha Conversion
The $\alpha$ conversion is used to rename bound variables ([[id:902f87e7-80c1-4f31-9d0d-89e8bf25e55e][What are free and bound variables in the lambda calculus?]]).
This is sometimes required during application because otherwise the free variable may be captured.

#+begin_src latex
  \begin{equation}
    \label{eqn:example-alpha-conversion}
    \begin{align}
      &\lambda x. \; x \; z \\
      &= \lambda a. \; a \; z \quad | \alpha \\
      &= \lambda b. \; b \; z \quad | \alpha \\
      & \ne \lambda z. \; z \; z \quad | \alpha
    \end{align}
  \end{equation}
#+end_src

** Beta Reduction
The $\beta$ reduction is nothing else than one function application.
In the equation eqref:eqn:beta-reduction-example the "a" is applied to the lambda term.
Therefore, the "y" is replaced with "a".

#+begin_src latex
  \begin{equation}
    \label{eqn:beta-reduction-example}
    \begin{align}
      &\underline{(\lambda y. \; y) \; a} \; b \\
      &= a \; b
    \end{align}
  \end{equation}
#+end_src

** Normal Form
A \lambda-term is then in the normal form if no further reduction ([[id:3bd4e25b-8abf-4185-90bd-fa18465bae47][Beta Reduction]]) is possible.
Equation eqref:eqn:normal-form-one and eqref:eqn:normal-form-two are evaluated using two different strategies.
Howerver, both are at the end in the normal form.

Every \lambda-term has at most one normal form.
Some \lambda-terms do not have a normal form (see eqref:eqn:non-terminating-evaluation).

#+begin_src latex
  \begin{equation}
    \label{eqn:normal-form-one}
    \begin{align}
      &(\lambda x. \; square \; x) \; (\underline{(\lambda y. \' square \; y) 5}) \\
      &= \underline{(\lambda x. \; square \; x) \; (square \; 5)} \\
      &= square \; (square \; 5)
    \end{align}
  \end{equation}

  \begin{equation}
    \label{eqn:normal-form-two}
    \begin{align}
      &\underline{(\lambda x. \; square \; x) \; ((\lambda y. \; square \; y) 5)} \\
      &= \underline{squre \; ((\lambda y. \; square \; y) 5)} \\
      &= square \; (square \; 5)
    \end{align}
  \end{equation}

  \begin{equation}
    \label{eqn:non-terminating-evaluation}
    \begin{align}
      &\underline{(\lambda x. \; x \; x) \; (\lambda x. \; x \; x)} \\
      &= \underline{(\lambda x. \; x \; x) \; (\lambda x. \; x \; x)} \\
      &= \underline{(\lambda x. \; x \; x) \; (\lambda x. \; x \; x)} \\
      & \vdots
    \end{align}
  \end{equation}
#+end_src

** Delta Reduction
The \delta-reduction replaces the free variable ([[id:902f87e7-80c1-4f31-9d0d-89e8bf25e55e][What are free and bound variables in the lambda calculus?]]) with its definition.

#+begin_src latex
  \begin{equation}
    \label{}
    \begin{align}
      &square = \lambda x. \; * \; x \; x \\
      &\underline{(\lambda x. \; square \; x) \; 5} \\
      &= (square \; 5) \quad | \; \beta \\
      &= (\underline{(\lambda x. \; * \; x \; x) \; 5}) \quad | \; \delta \\
      &= (* \; 5 \; 5) \quad | \; \beta
    \end{align}
  \end{equation}

#+end_src

** Evaluation Strategies

Evaluation strategies describe in which order redexs (reducible expression, any \beta, \delta reducible sub-term) are reduced.


A few of them are:
- [[id:cf8c34a4-be87-4249-86d8-f0ac12f2c591][leftmost innermost]] / applicative order / innermost first
- [[id:271a0c5d-0c4d-4531-9696-5b13ad523df2][leftmost outermost]] / normal order / outermost first
- [[id:25afcc25-7a2c-4898-91e3-96d2dcb8a922][The lazy evaluation]] / call by need


** Leftmost innermost
Using this evaluation strategy the innermost redex is reduced first.
In case there is more than one innermost redex, the leftmost innermost redex is reduced first.
A redex is innermost, if there is no other redex inside it.

Using this strategy the functions arguments are reduced exactly once.
It is also called *Call by value*.

#+begin_src latex
  \begin{equation}
    \label{eqn:example-of-leftmost-innermost}
    \begin{align}
      &\underline{square} \; (square \; 5) \\
      &= (\lambda x. \; * \; x \; x) (\underline{square} \; 5) \\
      &= (\lambda x. \; * \; x \; x) (\underline{(\lambda x. \; * \; x \; x) 5}) \\
      &= \underline{(\lambda x. \; * \; x \; x) (* \; 5 \; 5)} \\
      &= (* \; (* \; 5 \; 5) \; (* \; 5 \; 5))
    \end{align}
  \end{equation}
#+end_src

** Leftmost outermost
Using this evaluation strategy the outermost redex is reduced first.
In case there is more than one outermost redex, the leftmost outermost redex is reduced first.
A redex is outermost, if there is no other redex outside it.

A functions arguments are reduced as often as they are needed.
This startegy will always find the normal form if one exits.
It is also called call by name.

#+begin_src latex
  \begin{equation}
    \label{blub}
    \begin{align}
      &\underline{square} \; (square \; 5) \\
      &= \underline{(\lambda x. \; * \; x \; x) \; (square \; 5)} \\
      &= (* \; (\underline{square} \; 5) \; (square \; 5)) \\
      &= (* \; (\underline{(\lambda .x \; * \; x \; x) 5)}) \; (square \; 5)) \\
      &= (* \; (* \; 5 \; 5) \; (\underline{square} \; 5)) \\
      &= (* \; (* \; 5 \; 5) \; (\underline{(\lambda .x \; * \; x \; x) \; 5})) \\
      &= (* \; (* \; 5 \; 5) \; (* \; 5 \; 5))
    \end{align}
  \end{equation}
#+end_src

** Lazy Evaluation
The lazy evaluation is a combination of [[id:cf8c34a4-be87-4249-86d8-f0ac12f2c591][leftmost innermost]] and [[id:271a0c5d-0c4d-4531-9696-5b13ad523df2][leftmost outermost]].
It uses the property from [[id:cf8c34a4-be87-4249-86d8-f0ac12f2c591][leftmost innermost]] (exactly once) and from [[id:271a0c5d-0c4d-4531-9696-5b13ad523df2][leftmost outermost]] (when needed, finds normal form).

The lazy evaluation performs the [[id:271a0c5d-0c4d-4531-9696-5b13ad523df2][leftmost outermost]] strategy.
However, it uses memoization (caching).
If an expression was already evaluated it will use the same evaluated result again.
[[id:c9a2a575-2295-45af-981c-4ea1c0d27363][Haskell]] uses this strategy for evaluation.

* Property Based Testing
\end{multicols}
* Reasoning
** Vollständige Induktion
1. Verankerung 
2. Induktionsschritt
   1) Induktionsannahme
   2) Induktionsbehauptung
   3) Induktionsbeweis

*** Beispiel
Beweise dass folgendes gilt: $$\sum_{k=1}^n (k) = \frac{1}{2} \cdot n (n + 1)$$

1. Verankerung ($n_0 = 1$)
   Linke Seite $\sum_{k=1}^1 k = 1$, Rechte Seite $\frac{1}{2} \cdot 1 (1 + 1) = 1$

2. Induktionsschirtt $n \Rightarrow n + 1$
   1. Induktionsanhame:
      $$\sum_{k=1}^n (k) = \frac{1}{2} \cdot n (n + 1)$$
   2. Induktionsbehauptung
      $$\sum_{k=1}^{n+1} (k) = \frac{1}{2} \cdot (n+1) (n + 2)$$
   3. Induktionsbeweis
      1. $$\sum_{k=1}^{n+1} (k) = \left(\sum_{k=1}^n k\right) + n + 1$$
      2. $$\sum_{k=1}^{n+1} (k) = \frac{1}{2} \cdot n \cdot (n + 1) + n + 1$$
      3. $$\sum_{k=1}^{n+1} (k) = \frac{1}{2} \cdot (n^2 + n + 2n +2) = \frac{1}{2} \cdot (n^2 + 3n + 2)$$
      4. $$\sum_{k=1}^{n+1} (k) = \frac{1}{2} \cdot (n + 1) \cdot (n+2)$$
