FP/fp_summary.tex


\subparagraph{Alpha Conversion} \
\label{sec:org65bae8d}
The \(\alpha\) conversion is used to rename bound variables (\href{../../../roam/20220616081515-what_are_free_and_bound_variables_in_the_lambda_calculs.org}{What are free and bound variables in the lambda calculus?}).
This is sometimes required during application because otherwise the free variable may be captured.

\begin{equation}
  \label{eqn:example-alpha-conversion}
  \begin{align}
    &\lambda x. \; x \; z \\
    &= \lambda a. \; a \; z \quad | \alpha \\
    &= \lambda b. \; b \; z \quad | \alpha \\
    & \ne \lambda z. \; z \; z \quad | \alpha
  \end{align}
\end{equation}

\subparagraph{Beta Reduction} \
\label{sec:orgeba6760}
The \(\beta\) reduction is nothing else than one function application.
In the equation \eqref{eqn:beta-reduction-example} the "a" is applied to the lambda term.
Therefore, the "y" is replaced with "a".

\begin{equation}
  \label{eqn:beta-reduction-example}
  \begin{align}
    &\underline{(\lambda y. \; y) \; a} \; b \\
    &= a \; b
  \end{align}
\end{equation}

\subparagraph{Normal Form} \
\label{sec:org3ee8557}
A \(\lambda\)-term is then in the normal form if no further reduction (\href{../../../roam/20220616084329-what_is_the_beta_reduction.org}{Beta Reduction}) is possible.
Equation \eqref{eqn:normal-form-one} and \eqref{eqn:normal-form-two} are evaluated using two different strategies.
Howerver, both are at the end in the normal form.

Every \(\lambda\)-term has at most one normal form.
Some \(\lambda\)-terms do not have a normal form (see \eqref{eqn:non-terminating-evaluation}).

\begin{equation}
  \label{eqn:normal-form-one}
  \begin{align}
    &(\lambda x. \; square \; x) \; (\underline{(\lambda y. \' square \; y) 5}) \\
    &= \underline{(\lambda x. \; square \; x) \; (square \; 5)} \\
    &= square \; (square \; 5)
  \end{align}
\end{equation}

\begin{equation}
  \label{eqn:normal-form-two}
  \begin{align}
    &\underline{(\lambda x. \; square \; x) \; ((\lambda y. \; square \; y) 5)} \\
    &= \underline{squre \; ((\lambda y. \; square \; y) 5)} \\
    &= square \; (square \; 5)
  \end{align}
\end{equation}

\begin{equation}
  \label{eqn:non-terminating-evaluation}
  \begin{align}
    &\underline{(\lambda x. \; x \; x) \; (\lambda x. \; x \; x)} \\
    &= \underline{(\lambda x. \; x \; x) \; (\lambda x. \; x \; x)} \\
    &= \underline{(\lambda x. \; x \; x) \; (\lambda x. \; x \; x)} \\
    & \vdots
  \end{align}
\end{equation}

\subparagraph{Delta Reduction} \
\label{sec:orgd1a7631}
The \(\delta\)-reduction replaces the free variable (\href{../../../roam/20220616081515-what_are_free_and_bound_variables_in_the_lambda_calculs.org}{What are free and bound variables in the lambda calculus?}) with its definition.

\begin{equation}
  \label{}
  \begin{align}
    &square = \lambda x. \; * \; x \; x \\
    &\underline{(\lambda x. \; square \; x) \; 5} \\
    &= (square \; 5) \quad | \; \beta \\
    &= (\underline{(\lambda x. \; * \; x \; x) \; 5}) \quad | \; \delta \\
    &= (* \; 5 \; 5) \quad | \; \beta
  \end{align}
\end{equation}

\subparagraph{Evaluation Strategies} \
\label{sec:org218fbd6}

Evaluation strategies describe in which order redexs (reducible expression, any \(\beta\), \(\delta\) reducible sub-term) are reduced.


A few of them are:
\begin{itemize}
\item \href{../../../roam/20220616093057-the_leftmost_innermost_evaluation_strategy.org}{leftmost innermost} / applicative order / innermost first
\item \href{../../../roam/20220616104603-the_leftmost_outermost_evaluation_strategy.org}{leftmost outermost} / normal order / outermost first
\item \href{../../../roam/20220616110146-the_lazy_evaluation.org}{The lazy evaluation} / call by need
\end{itemize}


\subparagraph{Leftmost innermost} \
\label{sec:orgd35e7e7}
Using this evaluation strategy the innermost redex is reduced first.
In case there is more than one innermost redex, the leftmost innermost redex is reduced first.
A redex is innermost, if there is no other redex inside it.

Using this strategy the functions arguments are reduced exactly once.
It is also called \textbf{Call by value}.

\begin{equation}
  \label{eqn:example-of-leftmost-innermost}
  \begin{align}
    &\underline{square} \; (square \; 5) \\
    &= (\lambda x. \; * \; x \; x) (\underline{square} \; 5) \\
    &= (\lambda x. \; * \; x \; x) (\underline{(\lambda x. \; * \; x \; x) 5}) \\
    &= \underline{(\lambda x. \; * \; x \; x) (* \; 5 \; 5)} \\
    &= (* \; (* \; 5 \; 5) \; (* \; 5 \; 5))
  \end{align}
\end{equation}

\subparagraph{Leftmost outermost} \
\label{sec:org973c27b}
Using this evaluation strategy the outermost redex is reduced first.
In case there is more than one outermost redex, the leftmost outermost redex is reduced first.
A redex is outermost, if there is no other redex outside it.

A functions arguments are reduced as often as they are needed.
This startegy will always find the normal form if one exits.
It is also called call by name.

\begin{equation}
  \label{blub}
  \begin{align}
    &\underline{square} \; (square \; 5) \\
    &= \underline{(\lambda x. \; * \; x \; x) \; (square \; 5)} \\
    &= (* \; (\underline{square} \; 5) \; (square \; 5)) \\
    &= (* \; (\underline{(\lambda .x \; * \; x \; x) 5)}) \; (square \; 5)) \\
    &= (* \; (* \; 5 \; 5) \; (\underline{square} \; 5)) \\
    &= (* \; (* \; 5 \; 5) \; (\underline{(\lambda .x \; * \; x \; x) \; 5})) \\
    &= (* \; (* \; 5 \; 5) \; (* \; 5 \; 5))
  \end{align}
\end{equation}

\subparagraph{Lazy Evaluation} \
\label{sec:orgc8658fc}
The lazy evaluation is a combination of \href{../../../roam/20220616093057-the_leftmost_innermost_evaluation_strategy.org}{leftmost innermost} and \href{../../../roam/20220616104603-the_leftmost_outermost_evaluation_strategy.org}{leftmost outermost}.
It uses the property from \href{../../../roam/20220616093057-the_leftmost_innermost_evaluation_strategy.org}{leftmost innermost} (exactly once) and from \href{../../../roam/20220616104603-the_leftmost_outermost_evaluation_strategy.org}{leftmost outermost} (when needed, finds normal form).

The lazy evaluation performs the \href{../../../roam/20220616104603-the_leftmost_outermost_evaluation_strategy.org}{leftmost outermost} strategy.
However, it uses memoization (caching).
If an expression was already evaluated it will use the same evaluated result again.
\href{../../../roam/20210618182407-haskell.org}{Haskell} uses this strategy for evaluation.

\section{Property Based Testing}
\label{sec:org5816406}
\end{multicols}
\section{Reasoning}
\label{sec:org6c47a40}
\subparagraph{Vollständige Induktion} \
\label{sec:org3cfccca}
\begin{enumerate}
\item Verankerung
\item Induktionsschritt
\begin{enumerate}
\item Induktionsannahme
\item Induktionsbehauptung
\item Induktionsbeweis
\end{enumerate}
\end{enumerate}

\begin{enumerate}
\item Beispiel
\label{sec:orgf227eea}
Beweise dass folgendes gilt: $$\sum_{k=1}^n (k) = \frac{1}{2} \cdot n (n + 1)$$

\begin{enumerate}
\item Verankerung (\(n_0 = 1\))
Linke Seite \(\sum_{k=1}^1 k = 1\), Rechte Seite \(\frac{1}{2} \cdot 1 (1 + 1) = 1\)

\item Induktionsschirtt \(n \Rightarrow n + 1\)
\begin{enumerate}
\item Induktionsanhame:
$$\sum_{k=1}^n (k) = \frac{1}{2} \cdot n (n + 1)$$
\item Induktionsbehauptung
$$\sum_{k=1}^{n+1} (k) = \frac{1}{2} \cdot (n+1) (n + 2)$$
\item Induktionsbeweis
\begin{enumerate}
\item $$\sum_{k=1}^{n+1} (k) = \left(\sum_{k=1}^n k\right) + n + 1$$
\item $$\sum_{k=1}^{n+1} (k) = \frac{1}{2} \cdot n \cdot (n + 1) + n + 1$$
\item $$\sum_{k=1}^{n+1} (k) = \frac{1}{2} \cdot (n^2 + n + 2n +2) = \frac{1}{2} \cdot (n^2 + 3n + 2)$$
\item $$\sum_{k=1}^{n+1} (k) = \frac{1}{2} \cdot (n + 1) \cdot (n+2)$$
\end{enumerate}
\end{enumerate}
\end{enumerate}
\end{enumerate}
\end{document}